circles/app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'mafeng' AND `users`.`password` = '123456' LIMIT 1
---
  def create
    @user = User.find_by(username: params[:username], password: params[:password])