circles/app/controllers/users_controller.rb

SELECT  `users`.* FROM `users`  ORDER BY id desc LIMIT 10 OFFSET 0
---
  def index
    @users = User.page(params[:page] || 1).per_page(params[:per_page] || 10).order("id desc")

INSERT INTO `users` (`username`, `password`, `created_at`, `updated_at`) VALUES ('mafeng', '123456', '2016-05-20 08:44:52', '2016-05-20 08:44:52')
---
  def create
    @user = User.new(params.require(:user).permit(:username, :password))
    if @user.save