circles/app/controllers/welcome_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
    @user = if session[:user_id]
      User.find session[:user_id]